<?php

namespace App\Domain\Generate;

final class Constants
{
    public const SUBJECTS = [
        'Математика',
        'Русский язык',
        'Английский язык',
        'Литература',
        'Биология',
        'Физическая культура',
        'География',
        'Химия',
        'Физика'
    ];

    public const  CLASSROOMS = [
        '5А', '5Б', '5В', '5Г'
    ];

    public const MALE_FIRST_NAMES = [
        'Александр',
        'Алексей',
        'Альберт',
        'Анатолий',
        'Андрей',
        'Антон',
        'Василий',
        'Артемо',
        'Афанасий',
        'Максим',
        'Федор',
        'Никита',
        'Сергей',
        'Константин'
    ];

    public const MALE_LAST_NAMES = [
        'Смирнов',
        'Иванов',
        'Кузнецов',
        'Соколов',
        'Попов',
        'Лебедев',
        'Козлов',
        'Новиков',
        'Морозов',
        'Петров',
        'Волков',
        'Соловьёв',
        'Васильев',
        'Зайцев',
        'Павлов',
        'Семёнов',
        'Голубев',
        'Виноградов'
    ];

    public const MALE_MIDDLE_NAME = [
        'Александрович',
        'Алексеевич',
        'Альбертович',
        'Анатольевич',
        'Андреевич',
        'Антонович',
        'Арсеньевич',
        'Артемович',
        'Афанасьевич',
        'Сергеевич',
        'Федорович',
        'Максимович',
        'Русланович',
        'Васильевич'
    ];
}

